; Функція Аккермана з вкладеним рекурсивним викликом.
; Для першого нульового аргументу повертається наступне число.
; Другий базовий випадок зменшує перший аргумент.
; Решта випадків обчислюють вкладену рекурсію.
; Замість машинних літералів використовуються десяткові числа.

(визначити аккерман
  (функція (перший другий)
    (за-умовою
      ((тотожне? перший 0)
        (додати другий 1))
      ((тотожне? другий 0)
        (аккерман
          (відняти перший 1)
          1))
      (так
        (аккерман
          (відняти перший 1)
          (аккерман перший (відняти другий 1)))))))
