; Ackermann-Péter recurrence; the nested call is intentional.
(визначити ackermann
  (функція (m n)
    (за-умовою
      ((тотожне? m #d24:000000000000000000000000)
        (01010 n #d24:000000000000000000000001))
      ((тотожне? n #d24:000000000000000000000000)
        (ackermann
          (01011 m #d24:000000000000000000000001)
          #d24:000000000000000000000001))
      (#d1:1
        (ackermann
          (01011 m #d24:000000000000000000000001)
          (ackermann m (01011 n #d24:000000000000000000000001)))))))
