; Підсумок завдань екосистеми СЕНС.
; Загальна кількість завдань 457.
; Виконано 232 завдання.
; Залишилося 225 завдань.
;
; Обчислюємо різницю між загальною та виконаною кількістю.
; Останній вираз повертає 225.

; Точні математичні значення Д24+ утворюються зі списків СЕНС.
(визначити завдання-число-два (довжина (як-є (а б))))
(визначити завдання-число-три (довжина (як-є (а б в))))
(визначити завдання-число-чотири (довжина (як-є (а б в г))))
(визначити завдання-число-п'ять (довжина (як-є (а б в г ґ))))
(визначити завдання-число-сім (довжина (як-є (а б в г ґ д е))))
(визначити завдання-число-десять (довжина (як-є (а б в г ґ д е є ж з))))
(визначити завдання-число-сто (помножити завдання-число-десять завдання-число-десять))
(визначити завдання-число-двісті-тридцять-два (додати (помножити завдання-число-два завдання-число-сто) (додати (помножити завдання-число-три завдання-число-десять) завдання-число-два)))
(визначити завдання-число-чотириста-п'ятдесят-сім (додати (помножити завдання-число-чотири завдання-число-сто) (додати (помножити завдання-число-п'ять завдання-число-десять) завдання-число-сім)))

(нехай ((усього завдання-число-чотириста-п'ятдесят-сім)
        (виконано завдання-число-двісті-тридцять-два))
  (відняти усього виконано))
