; Конкурс: розгорнути всі рівні вкладеності у зворотному порядку.
; Порожній вкладений список не є елементом результату.

(визначити розгорнути-один
  (функція (залишок акумулятор)
    (за-умовою
      ((атом? залишок) акумулятор)
      ((порожній? (перше залишок))
       (розгорнути-один (решта залишок) акумулятор))
      ((атом? (перше залишок))
       (розгорнути-один (решта залишок) (сполучити (перше залишок) акумулятор)))
      (так (розгорнути-один (решта залишок)
             (розгорнути-один (перше залишок) акумулятор))))))

(розгорнути-один (список 1 (список 2 3) 4) (як-є ()))
