; Конкурс: замкнена формула суми четвертих степенів без рекурсії.
; Закон для невід'ємного н: н(н+1)(2н+1)(3н(н+1)-1) поділити на 30.
; Тільки ратифікована українська укр-проєкція та десяткова Д24+ математика.
; Визнання виконуваною програмою - лише після СЕНС і Зіг Т5М змайнити та суду.
(визначити ч4-горнер
 (функція (н)
  (частка
   (помножити
    (помножити н (додати-1 н))
    (помножити
     (додати-1 (помножити 2 н))
     (відняти (помножити 3 (помножити н (додати-1 н))) 1)))
   30)))
(ч4-горнер 10)
