; Core4-проєкція D10 «якщо»: точний вибір значення і лінива гілка.
(за-умовою
 ((однакові? (якщо (однакові? (як-є а) (як-є а)) так) так)
  (за-умовою
   ((хибне? (якщо (однакові? (як-є а) (як-є б)) так))
    (за-умовою
     ((однакові? (якщо (однакові? (як-є а) (як-є б)) так ні) ні)
      (за-умовою
       ((однакові? (якщо (однакові? (як-є а) (як-є б)) (ні так) ні) ні)
        (за-умовою
         ((однакові? (якщо (однакові? (як-є а) (як-є а)) так (ні так)) так) так)
         (так ні)))
       (так ні)))
     (так ні)))
   (так ні)))
 (так ні))
