; Д11: доказ з двох значень; () та D1:ні не губляться.
(за-умовою
  ((однакові?
     (підстави-однозначного-пошуку
       (функція (елемент) так)
       (список (як-є ()) ні))
     (список (як-є кілька) (як-є ()) ні))
   (за-умовою
     ((однакові?
        (підстави-однозначного-пошуку
          (функція (елемент) так)
          (список ні))
        (список (як-є єдиний) ні))
      (за-умовою
        ((однакові?
           (підстави-однозначного-пошуку
             (функція (елемент) ні)
             (список (як-є а)))
           (список (як-є немає)))
         (за-умовою
           ((однакові?
              (підстави-однозначного-пошуку
                (функція (елемент) (перше (як-є ())))
                (як-є ()))
              (список (як-є немає)))
            (за-умовою
              ((однакові?
                 (підстави-однозначного-пошуку
                   (функція (елемент)
                     (за-умовою
                       ((однакові? елемент (як-є отрута))
                        (перше (як-є ())))
                       (так так)))
                   (список (як-є а) (як-є б) (як-є отрута)))
                 (список (як-є кілька) (як-є а) (як-є б)))
               так)
              (так ні)))
           (так ні)))
        (так ні)))
     (так ні)))
  (так ні))
