; Д11 LIST-TABULATE: нуль, порядок індексів та D1 у D3 списку.
(визначити індекси
  (табулювати-список число-три (функція (номер) номер)))
(за-умовою
  ((порожній?
     (табулювати-список
       число-нуль
       (функція (номер) (перше (як-є ())))))
   (за-умовою
     ((нуль? (перше індекси))
      (за-умовою
        ((нуль? (відняти (друге індекси) число-один))
         (за-умовою
           ((нуль? (відняти
                     (перше (решта (решта індекси)))
                     число-два))
            (порожній? (решта (решта (решта індекси)))))
           (так ні)))
        (так ні)))
     (так ні)))
  (так ні))
