; Д11 APPEND-REVERSE: tail може бути будь-якими даними, навіть D1:ні.
; На відміну від D3:(), такий результат є dotted pair, НЕ правильним списком.
(визначити результат-із-д1-хвостом
  (приєднати-обернену-голову
    (список так ні)
    ні))
(за-умовою
  ((однакові?
     результат-із-д1-хвостом
     (сполучити ні (сполучити так ні)))
   (за-умовою
     ((тотожне?
        (решта (решта результат-із-д1-хвостом))
        ні)
      (тотожне?
        (приєднати-обернену-голову (як-є ()) так)
        так))
     (так ні)))
  (так ні))
