; Д24. Мовний закон Аккермана; виконати після ackermann.setup.lisp.
; Еталон 61 = (3 × (3−1)) × (3×3+1) + 1; арифметика власна SENS.
(за-умовою
 ((нуль? (відняти (аккерман аккерман-число-нуль аккерман-число-три)
                     (додати аккерман-число-три аккерман-число-один)))
  (за-умовою
   ((нуль? (відняти (аккерман аккерман-число-один
                             (відняти аккерман-число-три аккерман-число-один))
                     (додати аккерман-число-три аккерман-число-один)))
    (нуль?
     (відняти (аккерман аккерман-число-три аккерман-число-три)
      (додати
       (помножити
        (помножити аккерман-число-три
                    (відняти аккерман-число-три аккерман-число-один))
        (додати (помножити аккерман-число-три аккерман-число-три)
                 аккерман-число-один))
       аккерман-число-один))))
   (так ні)))
 (так ні))
