; Д5:11100 ASSOC — перший збіг, правильний D3-список та D1 відмінність.
(за-умовою
  ((однакові?
     (знайти-за-ключем
       (як-є а)
       (список
         (сполучити (як-є а) (як-є один))
         (сполучити (як-є а) (як-є два))))
     (сполучити (як-є а) (як-є один)))
   (за-умовою
     ((однакові?
        (11100 (як-є б)
          (список
            (сполучити (як-є а) (як-є один))
            (сполучити (як-є б) (як-є два))))
        (сполучити (як-є б) (як-є два)))
      (за-умовою
        ((порожній?
           (знайти-за-ключем
             (як-є в)
             (список (сполучити (як-є а) (як-є один)))))
         (за-умовою
           ((порожній? (11100 (як-є а) (як-є ())))
            (за-умовою
              ((однакові?
                 (знайти-за-ключем
                   (як-є а)
                   (список (сполучити (як-є а) ні)))
                 (сполучити (як-є а) ні))
               (за-умовою
                 ((однакові?
                    (знайти-за-ключем
                      (як-є ())
                      (список (сполучити (як-є ()) (як-є ()))))
                    (сполучити (як-є ()) (як-є ())))
                  так)
                 (так ні)))
              (так ні)))
           (так ні)))
        (так ні)))
     (так ні)))
  (так ні))
