; Д5:11101 MEMBER; фізичний SENS підтверджує шість D1 законів.
(за-умовою
  ((значення-у-списку? (як-є а) (список (як-є а) (як-є б)))
   (за-умовою
     ((11101 (як-є б) (список (як-є а) (як-є б)))
      (за-умовою
        ((хибне?
           (значення-у-списку?
             (як-є в) (список (як-є а) (як-є б))))
         (за-умовою
           ((хибне? (значення-у-списку? (як-є а) (як-є ())))
            (за-умовою
              ((значення-у-списку? ні (список ні (як-є а)))
               (за-умовою
                 ((значення-у-списку?
                    (як-є ()) (список (як-є ()) (як-є а)))
                  так)
                 (так ні)))
              (так ні)))
           (так ні)))
        (так ні)))
     (так ні)))
  (так ні))
