; Д5:11110 PAIRLIS — точні відповідні пари, хвіст та порожній вхід.
(за-умовою
  ((хибне?
     (однакові?
       (спарувати
         (список (як-є а) (як-є б))
         (список (як-є один) (як-є два))
         (список (сполучити (як-є в) (як-є три))))
       (список
         (сполучити (як-є а) (як-є один))
         (сполучити (як-є б) (як-є два))
         (сполучити (як-є в) (як-є три)))))
   ні)
  ((хибне?
     (однакові? (спарувати (як-є ()) (як-є ()) (як-є ())) (як-є ())))
   ні)
  (так так))
