; Закони збільшення та зменшення математичного числа на одиницю.
; Перевіряємо оберненість операцій і відхилення неправильних відповідей.

(список
  (однакові? (додати-1 (довжина (як-є ()))) (довжина (як-є (а))))
  (однакові? (додати-1 (довжина (як-є (а)))) (довжина (як-є (а б))))
  (однакові? (відняти-1 (довжина (як-є (а б)))) (довжина (як-є (а))))
  (однакові? (відняти-1 (довжина (як-є (а)))) (довжина (як-є ())))
  (однакові? (додати-1 (відняти-1 (довжина (як-є (а))))) (довжина (як-є (а))))
  (однакові? (відняти-1 (додати-1 (довжина (як-є ())))) (довжина (як-є ())))
  (хибне? (однакові? (додати-1 (довжина (як-є (а)))) (довжина (як-є (а)))))
  (хибне? (однакові? (відняти-1 (довжина (як-є (а б)))) (довжина (як-є (а б))))))
