; Вісім законів мінімуму і максимуму для точних чисел.
; Перевіряються один та кілька аргументів і від'ємне значення.
(список
  (однакові? (найменше (довжина (як-є (а б в))) (довжина (як-є (а))) (довжина (як-є (а б)))) (довжина (як-є (а))))
  (однакові? (найменше (довжина (як-є (а б)))) (довжина (як-є (а б))))
  (однакові? (найменше (довжина (як-є (а б в г ґ))) (довжина (як-є (а б в г))) (довжина (як-є (а б в)))) (довжина (як-є (а б в))))
  (однакові? (найменше (змінити-знак (довжина (як-є (а)))) (довжина (як-є (а б))) (довжина (як-є ()))) (змінити-знак (довжина (як-є (а)))))
  (однакові? (найбільше (довжина (як-є (а б в))) (довжина (як-є (а))) (довжина (як-є (а б)))) (довжина (як-є (а б в))))
  (однакові? (найбільше (довжина (як-є (а б)))) (довжина (як-є (а б))))
  (однакові? (найбільше (довжина (як-є (а б в г ґ))) (довжина (як-є (а б в г))) (довжина (як-є (а б в)))) (довжина (як-є (а б в г ґ))))
  (однакові? (найбільше (змінити-знак (довжина (як-є (а)))) (довжина (як-є (а б))) (довжина (як-є ()))) (довжина (як-є (а б)))))
