; Закони найменшого й найбільшого значення у списку математичних чисел.
; Перевіряємо порожній, одноелементний і багатоелементний випадки.

(список
  (однакові? (найменше-у-списку (як-є ())) (як-є ()))
  (однакові? (найбільше-у-списку (як-є ())) (як-є ()))
  (однакові? (найменше-у-списку (список (довжина (як-є (а б в))) (довжина (як-є (а))) (довжина (як-є (а б))))) (довжина (як-є (а))))
  (однакові? (найбільше-у-списку (список (довжина (як-є (а б в))) (довжина (як-є (а))) (довжина (як-є (а б))))) (довжина (як-є (а б в))))
  (однакові? (найменше-у-списку (список (довжина (як-є ())))) (довжина (як-є ())))
  (однакові? (найбільше-у-списку (список (довжина (як-є (а б))))) (довжина (як-є (а б))))
  (хибне? (однакові? (найменше-у-списку (список (довжина (як-є (а б в))) (довжина (як-є (а))) (довжина (як-є (а б))))) (довжина (як-є (а б)))))
  (хибне? (однакові? (найбільше-у-списку (список (довжина (як-є (а б в))) (довжина (як-є (а))) (довжина (як-є (а б))))) (довжина (як-є (а))))))
