; D6 NTH: D12+ 0, 1, поза межами і порожній список.
(за-умовою
  ((тотожне? (елемент-списку-за-індексом число-нуль (список так ні)) так)
   (за-умовою
     ((тотожне? (елемент-списку-за-індексом число-один (список так ні)) ні)
      (за-умовою
        ((порожній? (елемент-списку-за-індексом число-два (список так ні)))
         (за-умовою
           ((порожній? (елемент-списку-за-індексом число-нуль (як-є ()))) так)
           (так (перше (як-є ())))))
        (так (перше (як-є ())))))
     (так (перше (як-є ())))))
  (так (перше (як-є ()))))
