; Закони похідних відношень порядку математичних значень.
; Перевіряються рівність, строгий і нестрогий порядок та заперечення.

(список
  (не-більше? (довжина (як-є ())) (довжина (як-є ())))
  (не-більше? (довжина (як-є ())) (довжина (як-є (а))))
  (хибне? (не-більше? (довжина (як-є (а))) (довжина (як-є ()))))
  (не-менше? (довжина (як-є (а))) (довжина (як-є (а))))
  (не-менше? (довжина (як-є (а б))) (довжина (як-є (а))))
  (хибне? (не-менше? (довжина (як-є ())) (довжина (як-є (а)))))
  (хибне? (не-більше? (довжина (як-є (а б))) (довжина (як-є (а)))))
  (хибне? (не-менше? (довжина (як-є ())) (довжина (як-є (а б))))))
