; Закони отримання та відкидання початку списку та часткового застосування.
; Кількості задаються десятковими математичними числами.
; Виконувані виклики використовують повні українські назви ратифікованих функцій.

(список
  (однакові? (взяти 2
                 (список (як-є а) (як-є б) (як-є в)))
          (список (як-є а) (як-є б)))
  (однакові? (взяти 0
                 (список (як-є а)))
          (як-є ()))
  (однакові? (відкинути 1
                     (список (як-є а) (як-є б) (як-є в)))
          (список (як-є б) (як-є в)))
  (однакові? (відкинути 0
                     (список (як-є а)))
          (список (як-є а)))
  (однакові? ((частково-застосувати сполучити (як-є ікс)) (як-є ()))
          (сполучити (як-є ікс) (як-є ())))
  (однакові? (додати-1 1)
          2))
