; Закони отримання та відкидання початку списку та часткового застосування.
; Кількості задаються десятковими математичними числами.
; Виконувані виклики використовують повні українські назви ратифікованих функцій.

(визначити взяти
  (функція (кількість значення)
    (за-умовою
      ((нуль? кількість) (як-є ()))
      ((порожній? значення) (як-є ()))
      ((хибне? (порожній? значення))
       (сполучити (перше значення) (взяти (відняти-1 кількість) (решта значення)))))))
(визначити відкинути
  (функція (кількість значення)
    (за-умовою
      ((нуль? кількість) значення)
      ((порожній? значення) значення)
      ((хибне? (порожній? значення))
       (відкинути (відняти-1 кількість) (решта значення))))))
(список
  (однакові? (взяти 2
                 (список (як-є а) (як-є б) (як-є в)))
          (список (як-є а) (як-є б)))
  (однакові? (взяти 0
                 (список (як-є а)))
          (як-є ()))
  (однакові? (відкинути 1
                     (список (як-є а) (як-є б) (як-є в)))
          (список (як-є б) (як-є в)))
  (однакові? (відкинути 0
                     (список (як-є а)))
          (список (як-є а)))
  (однакові? ((частково-застосувати сполучити (як-є ікс)) (як-є ()))
          (сполучити (як-є ікс) (як-є ())))
  (однакові? (додати-1 1)
          2))
