; Закони парування та розпарування послідовностей однакової довжини.
; Перевіряємо порожній випадок, відновлення обох списків та порядок елементів.

(список
  (однакові? (спарувати-послідовності (як-є ()) (як-є ())) (як-є ()))
  (однакові? (розпарувати-пари (як-є ())) (список (як-є ()) (як-є ())))
  (однакові? (спарувати-послідовності (список (як-є а) (як-є б))
                                  (список (як-є в) (як-є г)))
          (список (сполучити (як-є а) (як-є в)) (сполучити (як-є б) (як-є г))))
  (однакові? (розпарувати-пари
            (спарувати-послідовності (список (як-є а) (як-є б))
                                    (список (як-є в) (як-є г))))
          (список (список (як-є а) (як-є б)) (список (як-є в) (як-є г))))
  (хибне? (однакові? (розпарувати-пари
                  (спарувати-послідовності (список (як-є а) (як-є б))
                                          (список (як-є в) (як-є г))))
                (список (список (як-є в) (як-є г)) (список (як-є а) (як-є б))))))
