; Закони перевірки будь-якого та всіх елементів за запереченим предикатом.
; Охоплено позитивні, негативні та порожні випадки.

(список
  (є-що-не-задовольняє? (функція (значення) (тотожне? значення (як-є яблуко)))
                          (список (як-є яблуко) (як-є груша)))
  (хибне? (є-що-не-задовольняє? (функція (значення) (тотожне? значення (як-є яблуко)))
                                  (список (як-є яблуко))))
  (хибне? (є-що-не-задовольняє? (функція (значення) (тотожне? значення (як-є яблуко)))
                                  (список)))
  (усі-не-задовольняють? (функція (значення) (тотожне? значення (як-є яблуко)))
                           (список (як-є груша) (як-є груша)))
  (хибне? (усі-не-задовольняють? (функція (значення) (тотожне? значення (як-є яблуко)))
                                  (список (як-є груша) (як-є яблуко))))
  (усі-не-задовольняють? (функція (значення) (тотожне? значення (як-є яблуко)))
                           (список)))
