; Закони логічного поєднання восьмого й дев'ятого доменів.
; Перевіряється ратифікована проєкція функції п'ятий.
; Вісім перевірок включають правильні випадки та спростування.
(список
  (та (однакові? (як-є а) (як-є а)) (однакові? (як-є б) (як-є б)))
  (хибне? (та (однакові? (як-є а) (як-є а)) (однакові? (як-є а) (як-є б))))
  (або (однакові? (як-є а) (як-є б)) (однакові? (як-є а) (як-є а)))
  (хибне? (або (однакові? (як-є а) (як-є б)) (однакові? (як-є б) (як-є а))))
  (або (однакові? (як-є а) (як-є а)) (однакові? (як-є а) (як-є б)))
  (однакові? (п'ятий (список (як-є а) (як-є б) (як-є в) (як-є г) (як-є д))) (як-є д))
  (однакові? (п'ятий (список (як-є а) (як-є б) (як-є в) (як-є г) (як-є д) (як-є е))) (як-є д))
  (хибне? (однакові? (п'ятий (список (як-є а) (як-є б) (як-є в) (як-є г) (як-є д))) (як-є г))))
