; Закони перетворення тексту, символів та кодів знаків.
; Значення коду української великої літери А дорівнює 1040.
; Сім перевірок містять правильні рівності та спростування.
(список
  (однакові? (код-символу "А") 1040)
  (однакові? (текст-у-символ "вовк") (як-є вовк))
  (однакові? (символ-у-текст (як-є вовк)) "вовк")
  (однакові? (символ-у-текст (текст-у-символ "вовк")) "вовк")
  (хибне? (однакові? (текст-у-символ "вовк") (як-є кіт)))
  (хибне? (однакові? (код-символу "А") (код-символу "Б")))
  (однакові? (текст-у-символ (символ-у-текст (як-є вовк))) (як-є вовк)))
