; Д8 у Core1: та й або дають D1-відповіді та коротко обчислюють гілки.
(за-умовою
  ((та)
   (за-умовою
     ((хибне? (або))
      (за-умовою
        ((та (однакові? (як-є а) (як-є а)) (однакові? (як-є б) (як-є б)))
         (за-умовою
           ((хибне? (та (однакові? (як-є а) (як-є б)) (ні так)))
            (за-умовою
              ((або (однакові? (як-є а) (як-є б)) (однакові? (як-є б) (як-є б)))
               (за-умовою
                 ((або (однакові? (як-є а) (як-є а)) (ні так)) так)
                 (так ні)))
              (так ні)))
           (так ні)))
        (так ні)))
     (так ні)))
  (так ні))
