; Закони копіювання правильного списку восьмого домену.
; Перевіряємо порожнє значення, вкладені списки, порядок і повторне копіювання.

(список
  (порожній? (копіювати-список (як-є ())))
  (однакові? (копіювати-список (список (як-є а) (як-є б)))
          (список (як-є а) (як-є б)))
  (однакові? (копіювати-список (список (список (як-є а)) (як-є б)))
          (список (список (як-є а)) (як-є б)))
  (хибне? (однакові? (копіювати-список (список (як-є а) (як-є б)))
                (список (як-є б) (як-є а))))
  (однакові? (перше (копіювати-список (список (як-є а) (як-є б))))
          (як-є а))
  (однакові? (решта (копіювати-список (список (як-є а) (як-є б))))
          (список (як-є б)))
  (однакові? (копіювати-список
            (копіювати-список (список (як-є а) (як-є б))))
          (список (як-є а) (як-є б)))
  (однакові? (копіювати-список (список (як-є а) (як-є а)))
          (список (як-є а) (як-є а))))
