; Закони ділення з одночасним поверненням частки та остачі.
; Кожен результат є списком двох десяткових чисел.
(список
  (однакові? (поділити-з-часткою-й-остачею (довжина (як-є (а б в г ґ д е є ж з))) (довжина (як-є (а б в)))) (список (довжина (як-є (а б в))) (довжина (як-є (а)))))
  (однакові? (поділити-з-часткою-й-остачею (довжина (як-є (а б в г ґ д е є))) (довжина (як-є (а б)))) (список (довжина (як-є (а б в г))) (довжина (як-є ()))))
  (однакові? (поділити-з-часткою-й-остачею (довжина (як-є (а))) (довжина (як-є (а б)))) (список (довжина (як-є ())) (довжина (як-є (а)))))
  (однакові? (поділити-з-часткою-й-остачею (довжина (як-є ())) (довжина (як-є (а б в)))) (список (довжина (як-є ())) (довжина (як-є ()))))
  (однакові? (поділити-з-часткою-й-остачею (довжина (як-є (а б в г ґ д е))) (довжина (як-є (а б)))) (список (довжина (як-є (а б в))) (довжина (як-є (а))))))
