; Закони відображення до першої невідповідності та короткого завершення обходу.
; Порівнюємо порожні й нерівні списки, зокрема негативні результати.

(список
  (хибне? (відобразити-доки-істина (функція (елемент) (тотожне? елемент (як-є є))) (як-є ())))
  (відобразити-доки-істина (функція (елемент) (тотожне? елемент (як-є є)))
                           (список (як-є нема) (як-є є)))
  (хибне? (відобразити-доки-істина (функція (елемент) (тотожне? елемент (як-є є)))
                                 (список (як-є нема) (як-є ні))))
  (відобразити-доки-істина (функція (елемент) (тотожне? елемент (як-є є)))
                           (список (як-є є) (як-є нема)))
  (однакові? (відобразити-доки-істина (функція (елемент) (тотожне? елемент (як-є є)))
                                    (список (як-є є)))
          (будь-яке? (функція (елемент) (тотожне? елемент (як-є є))) (список (як-є є))))
  (однакові? (відобразити-доки-істина (функція (елемент) (тотожне? елемент (як-є є))) (як-є ()))
          (будь-яке? (функція (елемент) (тотожне? елемент (як-є є))) (як-є ())))
  (хибне? (відобразити-доки-істина (функція (елемент) (тотожне? елемент (як-є є)))
                                 (список (як-є ні) (як-є ні))))
  (відобразити-доки-істина (функція (елемент) (тотожне? елемент (як-є є)))
                           (список (як-є ні) (як-є є) (як-є ні))))
