; Вісім законів структурної рівності порожніх та непорожніх списків.
; Перевіряються правильні списки, пари й розрізнення різних атомів.
(список
  (однакові? (як-є ()) (як-є ()))
  (хибне? (однакові? (як-є ()) (як-є а)))
  (хибне? (однакові? (як-є а) (як-є ())))
  (однакові? (як-є а) (як-є а))
  (хибне? (однакові? (як-є а) (як-є б)))
  (однакові? (список (як-є а) (список (як-є б)))
             (список (як-є а) (список (як-є б))))
  (хибне? (однакові? (список (як-є а)) (список (як-є а) (як-є б))))
  (однакові? (сполучити (як-є а) (як-є хвіст))
             (сполучити (як-є а) (як-є хвіст))))

