; Три перевірки зворотного спарування та розпарування списків.
; Дві позитивні перевірки й одна негативна відрізняють напрямок.
; Структурна рівність перевіряється функцією однакові?.
(список
  (однакові?
    (розпарувати-пари-навпаки
      (спарувати-послідовності-навпаки
        (список (як-є ліве-а) (як-є ліве-б))
        (список (як-є праве-а) (як-є праве-б))))
    (список
      (список (як-є ліве-а) (як-є ліве-б))
      (список (як-є праве-а) (як-є праве-б))))
  (однакові?
    (розпарувати-пари-навпаки
      (спарувати-послідовності-навпаки (список) (список)))
    (список (список) (список)))
  (однакові?
    (розпарувати-пари-навпаки
      (спарувати-послідовності-навпаки
        (список (як-є ліве-а))
        (список (як-є праве-а))))
    (список
      (список (як-є праве-а))
      (список (як-є ліве-а)))))
