; Д8:10111001/10111011 — фізичний SENS-закон.
; Напрямок: право наліво; фінальний стан SCAN = REDUCE.
(за-умовою
  ((хибне? (однакові?
    (згорнути-справа
      (функція (ліво право) (сполучити ліво право))
      (як-є ())
      (список так ні))
    (список так ні))) ні)
  ((хибне? (однакові?
    (накопичувати-справа
      (функція (ліво право) (сполучити ліво право))
      (як-є ())
      (список так ні))
    (список (як-є ()) (список ні) (список так ні)))) ні)
  ((хибне? (однакові?
    (перше (зворот
      (накопичувати-справа
        (функція (ліво право) (сполучити ліво право))
        (як-є ())
        (список так ні))))
    (згорнути-справа
      (функція (ліво право) (сполучити ліво право))
      (як-є ())
      (список так ні)))) ні)
  (так так))
