; Закони правого згортання восьмого домену.
; Порядок аргументів перевіряється некомутативним сполученням пар.

(список
  (однакові? (згорнути-справа (функція (лівий правий) (сполучити лівий правий)) (як-є ()) (список (як-є ()) (список (як-є ())))) (список (як-є ()) (список (як-є ()))))
  (хибне? (однакові? (згорнути-справа (функція (лівий правий) (сполучити лівий правий)) (як-є ()) (список (як-є ()) (список (як-є ())))) (список (список (як-є ())) (як-є ()))))
  (порожній? (згорнути-справа (функція (лівий правий) (сполучити лівий правий)) (як-є ()) (як-є ())))
  (однакові? (згорнути-справа (функція (лівий правий) (сполучити лівий правий)) (як-є ()) (список (як-є ()))) (список (як-є ())))
)
