; D8:00100001 SUBSEQ via D5:01011, D6:110000/110001, індекси лише D24.
; По одному нативному D1:1 на рядок; 6 законів, серед них неправильна підпослідовність.
(equal? (підпослідовність (list (quote яблуко) (quote груша) (quote слива)) #d24:000000000000000000000000 #d24:000000000000000000000010) (list (quote яблуко) (quote груша)))
(equal? (підпослідовність (list (quote яблуко) (quote груша) (quote слива)) #d24:000000000000000000000001 #d24:000000000000000000000011) (list (quote груша) (quote слива)))
(null? (підпослідовність (list (quote яблуко) (quote груша) (quote слива)) #d24:000000000000000000000010 #d24:000000000000000000000010))
(equal? (підпослідовність (list (quote яблуко) (quote груша) (quote слива)) #d24:000000000000000000000000 #d24:000000000000000000000011) (list (quote яблуко) (quote груша) (quote слива)))
(not? (equal? (підпослідовність (list (quote яблуко) (quote груша) (quote слива)) #d24:000000000000000000000001 #d24:000000000000000000000011) (list (quote яблуко) (quote груша))))
(equal? (підпослідовність (list (quote яблуко) (quote груша) (quote слива)) #d24:000000000000000000000010 #d24:000000000000000000000011) (list (quote слива)))
