; Закони отримання та відкидання кінця списку.
; Порівнюємо порожні та непорожні випадки й негативні результати.

(список
  (однакові?
    (взяти-справа 2
      (список (як-є а) (як-є б) (як-є в)))
    (список (як-є б) (як-є в)))
  (однакові?
    (відкинути-справа 2
      (список (як-є а) (як-є б) (як-є в)))
    (список (як-є а)))
  (порожній?
    (взяти-справа 0
      (список (як-є а) (як-є б))))
  (однакові?
    (відкинути-справа 0
      (список (як-є а) (як-є б)))
    (список (як-є а) (як-є б)))
  (однакові?
    (взяти-справа 4
      (список (як-є а) (як-є б)))
    (список (як-є а) (як-є б)))
  (порожній?
    (відкинути-справа 4
      (список (як-є а) (як-є б)))))
