; Закони отримання та відкидання кінця списку.
; Порівнюємо порожні та непорожні випадки й негативні результати.

(список
  (однакові?
    (взяти-справа (довжина (як-є (а б)))
      (список (як-є а) (як-є б) (як-є в)))
    (список (як-є б) (як-є в)))
  (однакові?
    (відкинути-справа (довжина (як-є (а б)))
      (список (як-є а) (як-є б) (як-є в)))
    (список (як-є а)))
  (порожній?
    (взяти-справа (довжина (як-є ()))
      (список (як-є а) (як-є б))))
  (однакові?
    (відкинути-справа (довжина (як-є ()))
      (список (як-є а) (як-є б)))
    (список (як-є а) (як-є б)))
  (однакові?
    (взяти-справа (довжина (як-є (а б в г)))
      (список (як-є а) (як-є б)))
    (список (як-є а) (як-є б)))
  (порожній?
    (відкинути-справа (довжина (як-є (а б в г)))
      (список (як-є а) (як-є б)))))
