; D9:100100000..100100111: 8 визначень, по 2 нативні D1 свідки.
; Дерево будуємо від зовнішнього CAR/CDR до внутрішнього; застосовуємо шлях навпаки.
(список
  ; 100100000 CADAAAAAR
  (тотожне? (п-р-п-п-п-п-п (сполучити (сполучити (сполучити (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є ціль) (як-є бічне))) (як-є бічне)) (як-є бічне)) (як-є бічне)) (як-є бічне)) (як-є бічне))) (як-є ціль))
  (хибне? (тотожне? (п-р-п-п-п-п-п (сполучити (сполучити (сполучити (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є змінено) (як-є бічне))) (як-є бічне)) (як-є бічне)) (як-є бічне)) (як-є бічне)) (як-є бічне))) (як-є ціль)))
  ; 100100001 CADAAAADR
  (тотожне? (п-р-п-п-п-п-р (сполучити (як-є бічне) (сполучити (сполучити (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є ціль) (як-є бічне))) (як-є бічне)) (як-є бічне)) (як-є бічне)) (як-є бічне)))) (як-є ціль))
  (хибне? (тотожне? (п-р-п-п-п-п-р (сполучити (як-є бічне) (сполучити (сполучити (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є змінено) (як-є бічне))) (як-є бічне)) (як-є бічне)) (як-є бічне)) (як-є бічне)))) (як-є ціль)))
  ; 100100010 CADAAADAR
  (тотожне? (п-р-п-п-п-р-п (сполучити (сполучити (як-є бічне) (сполучити (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є ціль) (як-є бічне))) (як-є бічне)) (як-є бічне)) (як-є бічне))) (як-є бічне))) (як-є ціль))
  (хибне? (тотожне? (п-р-п-п-п-р-п (сполучити (сполучити (як-є бічне) (сполучити (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є змінено) (як-є бічне))) (як-є бічне)) (як-є бічне)) (як-є бічне))) (як-є бічне))) (як-є ціль)))
  ; 100100011 CADAAADDR
  (тотожне? (п-р-п-п-п-р-р (сполучити (як-є бічне) (сполучити (як-є бічне) (сполучити (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є ціль) (як-є бічне))) (як-є бічне)) (як-є бічне)) (як-є бічне))))) (як-є ціль))
  (хибне? (тотожне? (п-р-п-п-п-р-р (сполучити (як-є бічне) (сполучити (як-є бічне) (сполучити (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є змінено) (як-є бічне))) (як-є бічне)) (як-є бічне)) (як-є бічне))))) (як-є ціль)))
  ; 100100100 CADAADAAR
  (тотожне? (п-р-п-п-р-п-п (сполучити (сполучити (сполучити (як-є бічне) (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є ціль) (як-є бічне))) (як-є бічне)) (як-є бічне))) (як-є бічне)) (як-є бічне))) (як-є ціль))
  (хибне? (тотожне? (п-р-п-п-р-п-п (сполучити (сполучити (сполучити (як-є бічне) (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є змінено) (як-є бічне))) (як-є бічне)) (як-є бічне))) (як-є бічне)) (як-є бічне))) (як-є ціль)))
  ; 100100101 CADAADADR
  (тотожне? (п-р-п-п-р-п-р (сполучити (як-є бічне) (сполучити (сполучити (як-є бічне) (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є ціль) (як-є бічне))) (як-є бічне)) (як-є бічне))) (як-є бічне)))) (як-є ціль))
  (хибне? (тотожне? (п-р-п-п-р-п-р (сполучити (як-є бічне) (сполучити (сполучити (як-є бічне) (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є змінено) (як-є бічне))) (як-є бічне)) (як-є бічне))) (як-є бічне)))) (як-є ціль)))
  ; 100100110 CADAADDAR
  (тотожне? (п-р-п-п-р-р-п (сполучити (сполучити (як-є бічне) (сполучити (як-є бічне) (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є ціль) (як-є бічне))) (як-є бічне)) (як-є бічне)))) (як-є бічне))) (як-є ціль))
  (хибне? (тотожне? (п-р-п-п-р-р-п (сполучити (сполучити (як-є бічне) (сполучити (як-є бічне) (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є змінено) (як-є бічне))) (як-є бічне)) (як-є бічне)))) (як-є бічне))) (як-є ціль)))
  ; 100100111 CADAADDDR
  (тотожне? (п-р-п-п-р-р-р (сполучити (як-є бічне) (сполучити (як-є бічне) (сполучити (як-є бічне) (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є ціль) (як-є бічне))) (як-є бічне)) (як-є бічне)))))) (як-є ціль))
  (хибне? (тотожне? (п-р-п-п-р-р-р (сполучити (як-є бічне) (сполучити (як-є бічне) (сполучити (як-є бічне) (сполучити (сполучити (сполучити (як-є бічне) (сполучити (як-є змінено) (як-є бічне))) (як-є бічне)) (як-є бічне)))))) (як-є ціль)))
)
