; Перша група восьми семикрокових селекторів дев'ятого домену.
; Шістнадцять правильних орієнтацій та шістнадцять однобітних спростувань.
; Листки дерева різні, тому хибний маршрут не може дати правильну ціль.
((функція (дерево)
  (список
    ; Координата 011000000, маршрут р-п-п-п-п-п-п.
    (тотожне? (решта-від-перше-від-перше-від-перше-від-перше-від-перше-від-перше дерево) (як-є лист-0000001))
    (хибне? (тотожне? (перше (перше (перше (перше (перше (перше (перше дерево))))))) (як-є лист-0000001)))
    ; Координата 011000001, маршрут р-п-п-п-п-п-р.
    (тотожне? (решта-від-перше-від-перше-від-перше-від-перше-від-перше-від-решта дерево) (як-є лист-1000001))
    (хибне? (тотожне? (перше (перше (перше (перше (перше (перше (решта дерево))))))) (як-є лист-1000001)))
    ; Координата 011000010, маршрут р-п-п-п-п-р-п.
    (тотожне? (решта-від-перше-від-перше-від-перше-від-перше-від-решта-від-перше дерево) (як-є лист-0100001))
    (хибне? (тотожне? (перше (перше (перше (перше (перше (решта (перше дерево))))))) (як-є лист-0100001)))
    ; Координата 011000011, маршрут р-п-п-п-п-р-р.
    (тотожне? (решта-від-перше-від-перше-від-перше-від-перше-від-решта-від-решта дерево) (як-є лист-1100001))
    (хибне? (тотожне? (перше (перше (перше (перше (перше (решта (решта дерево))))))) (як-є лист-1100001)))
    ; Координата 011000100, маршрут р-п-п-п-р-п-п.
    (тотожне? (решта-від-перше-від-перше-від-перше-від-решта-від-перше-від-перше дерево) (як-є лист-0010001))
    (хибне? (тотожне? (перше (перше (перше (перше (решта (перше (перше дерево))))))) (як-є лист-0010001)))
    ; Координата 011000101, маршрут р-п-п-п-р-п-р.
    (тотожне? (решта-від-перше-від-перше-від-перше-від-решта-від-перше-від-решта дерево) (як-є лист-1010001))
    (хибне? (тотожне? (перше (перше (перше (перше (решта (перше (решта дерево))))))) (як-є лист-1010001)))
    ; Координата 011000110, маршрут р-п-п-п-р-р-п.
    (тотожне? (решта-від-перше-від-перше-від-перше-від-решта-від-решта-від-перше дерево) (як-є лист-0110001))
    (хибне? (тотожне? (перше (перше (перше (перше (решта (решта (перше дерево))))))) (як-є лист-0110001)))
    ; Координата 011000111, маршрут р-п-п-п-р-р-р.
    (тотожне? (решта-від-перше-від-перше-від-перше-від-решта-від-решта-від-решта дерево) (як-є лист-1110001))
    (хибне? (тотожне? (перше (перше (перше (перше (решта (решта (решта дерево))))))) (як-є лист-1110001)))

    ; Координата 011001000, маршрут р-п-п-р-п-п-п.
    (тотожне? (решта-від-перше-від-перше-від-решта-від-перше-від-перше-від-перше дерево) (як-є лист-0001001))
    (хибне? (тотожне? (перше (перше (перше (решта (перше (перше (перше дерево))))))) (як-є лист-0001001)))
    ; Координата 011001001, маршрут р-п-п-р-п-п-р.
    (тотожне? (решта-від-перше-від-перше-від-решта-від-перше-від-перше-від-решта дерево) (як-є лист-1001001))
    (хибне? (тотожне? (перше (перше (перше (решта (перше (перше (решта дерево))))))) (як-є лист-1001001)))
    ; Координата 011001010, маршрут р-п-п-р-п-р-п.
    (тотожне? (решта-від-перше-від-перше-від-решта-від-перше-від-решта-від-перше дерево) (як-є лист-0101001))
    (хибне? (тотожне? (перше (перше (перше (решта (перше (решта (перше дерево))))))) (як-є лист-0101001)))
    ; Координата 011001011, маршрут р-п-п-р-п-р-р.
    (тотожне? (решта-від-перше-від-перше-від-решта-від-перше-від-решта-від-решта дерево) (як-є лист-1101001))
    (хибне? (тотожне? (перше (перше (перше (решта (перше (решта (решта дерево))))))) (як-є лист-1101001)))
    ; Координата 011001100, маршрут р-п-п-р-р-п-п.
    (тотожне? (решта-від-перше-від-перше-від-решта-від-решта-від-перше-від-перше дерево) (як-є лист-0011001))
    (хибне? (тотожне? (перше (перше (перше (решта (решта (перше (перше дерево))))))) (як-є лист-0011001)))
    ; Координата 011001101, маршрут р-п-п-р-р-п-р.
    (тотожне? (решта-від-перше-від-перше-від-решта-від-решта-від-перше-від-решта дерево) (як-є лист-1011001))
    (хибне? (тотожне? (перше (перше (перше (решта (решта (перше (решта дерево))))))) (як-є лист-1011001)))
    ; Координата 011001110, маршрут р-п-п-р-р-р-п.
    (тотожне? (решта-від-перше-від-перше-від-решта-від-решта-від-решта-від-перше дерево) (як-є лист-0111001))
    (хибне? (тотожне? (перше (перше (перше (решта (решта (решта (перше дерево))))))) (як-є лист-0111001)))
    ; Координата 011001111, маршрут р-п-п-р-р-р-р.
    (тотожне? (решта-від-перше-від-перше-від-решта-від-решта-від-решта-від-решта дерево) (як-є лист-1111001))
    (хибне? (тотожне? (перше (перше (перше (решта (решта (решта (решта дерево))))))) (як-є лист-1111001)))

  ))
  (сполучити (сполучити (сполучити (сполучити (сполучити (сполучити (сполучити (як-є лист-0000000) (як-є лист-0000001)) (сполучити (як-є лист-0000010) (як-є лист-0000011))) (сполучити (сполучити (як-є лист-0000100) (як-є лист-0000101)) (сполучити (як-є лист-0000110) (як-є лист-0000111)))) (сполучити (сполучити (сполучити (як-є лист-0001000) (як-є лист-0001001)) (сполучити (як-є лист-0001010) (як-є лист-0001011))) (сполучити (сполучити (як-є лист-0001100) (як-є лист-0001101)) (сполучити (як-є лист-0001110) (як-є лист-0001111))))) (сполучити (сполучити (сполучити (сполучити (як-є лист-0010000) (як-є лист-0010001)) (сполучити (як-є лист-0010010) (як-є лист-0010011))) (сполучити (сполучити (як-є лист-0010100) (як-є лист-0010101)) (сполучити (як-є лист-0010110) (як-є лист-0010111)))) (сполучити (сполучити (сполучити (як-є лист-0011000) (як-є лист-0011001)) (сполучити (як-є лист-0011010) (як-є лист-0011011))) (сполучити (сполучити (як-є лист-0011100) (як-є лист-0011101)) (сполучити (як-є лист-0011110) (як-є лист-0011111)))))) (сполучити (сполучити (сполучити (сполучити (сполучити (як-є лист-0100000) (як-є лист-0100001)) (сполучити (як-є лист-0100010) (як-є лист-0100011))) (сполучити (сполучити (як-є лист-0100100) (як-є лист-0100101)) (сполучити (як-є лист-0100110) (як-є лист-0100111)))) (сполучити (сполучити (сполучити (як-є лист-0101000) (як-є лист-0101001)) (сполучити (як-є лист-0101010) (як-є лист-0101011))) (сполучити (сполучити (як-є лист-0101100) (як-є лист-0101101)) (сполучити (як-є лист-0101110) (як-є лист-0101111))))) (сполучити (сполучити (сполучити (сполучити (як-є лист-0110000) (як-є лист-0110001)) (сполучити (як-є лист-0110010) (як-є лист-0110011))) (сполучити (сполучити (як-є лист-0110100) (як-є лист-0110101)) (сполучити (як-є лист-0110110) (як-є лист-0110111)))) (сполучити (сполучити (сполучити (як-є лист-0111000) (як-є лист-0111001)) (сполучити (як-є лист-0111010) (як-є лист-0111011))) (сполучити (сполучити (як-є лист-0111100) (як-є лист-0111101)) (сполучити (як-є лист-0111110) (як-є лист-0111111))))))) (сполучити (сполучити (сполучити (сполучити (сполучити (сполучити (як-є лист-1000000) (як-є лист-1000001)) (сполучити (як-є лист-1000010) (як-є лист-1000011))) (сполучити (сполучити (як-є лист-1000100) (як-є лист-1000101)) (сполучити (як-є лист-1000110) (як-є лист-1000111)))) (сполучити (сполучити (сполучити (як-є лист-1001000) (як-є лист-1001001)) (сполучити (як-є лист-1001010) (як-є лист-1001011))) (сполучити (сполучити (як-є лист-1001100) (як-є лист-1001101)) (сполучити (як-є лист-1001110) (як-є лист-1001111))))) (сполучити (сполучити (сполучити (сполучити (як-є лист-1010000) (як-є лист-1010001)) (сполучити (як-є лист-1010010) (як-є лист-1010011))) (сполучити (сполучити (як-є лист-1010100) (як-є лист-1010101)) (сполучити (як-є лист-1010110) (як-є лист-1010111)))) (сполучити (сполучити (сполучити (як-є лист-1011000) (як-є лист-1011001)) (сполучити (як-є лист-1011010) (як-є лист-1011011))) (сполучити (сполучити (як-є лист-1011100) (як-є лист-1011101)) (сполучити (як-є лист-1011110) (як-є лист-1011111)))))) (сполучити (сполучити (сполучити (сполучити (сполучити (як-є лист-1100000) (як-є лист-1100001)) (сполучити (як-є лист-1100010) (як-є лист-1100011))) (сполучити (сполучити (як-є лист-1100100) (як-є лист-1100101)) (сполучити (як-є лист-1100110) (як-є лист-1100111)))) (сполучити (сполучити (сполучити (як-є лист-1101000) (як-є лист-1101001)) (сполучити (як-є лист-1101010) (як-є лист-1101011))) (сполучити (сполучити (як-є лист-1101100) (як-є лист-1101101)) (сполучити (як-є лист-1101110) (як-є лист-1101111))))) (сполучити (сполучити (сполучити (сполучити (як-є лист-1110000) (як-є лист-1110001)) (сполучити (як-є лист-1110010) (як-є лист-1110011))) (сполучити (сполучити (як-є лист-1110100) (як-є лист-1110101)) (сполучити (як-є лист-1110110) (як-є лист-1110111)))) (сполучити (сполучити (сполучити (як-є лист-1111000) (як-є лист-1111001)) (сполучити (як-є лист-1111010) (як-є лист-1111011))) (сполучити (сполучити (як-є лист-1111100) (як-є лист-1111101)) (сполучити (як-є лист-1111110) (як-є лист-1111111)))))))))
