; D9:010101011 / 010001010 / 010011001 — eight TMS selectors laws, D1 only.
(список
  (101 (факт-від (сполучити (як-є а) (список (як-є с)))) (як-є а))
  (101 (100 (підтримки-від (сполучити (як-є а) (список (як-є с))))) (як-є с))
  (0101 (підтримки-від (сполучити (як-є а) (як-є ()))))
  (0101 (мапа-факт-від (як-є ())))
  (101 (100 (мапа-факт-від (список (сполучити (як-є а) (список (як-є с))) (сполучити (як-є б) (список (як-є т)))))) (як-є а))
  (101 (100 (011 (мапа-факт-від (список (сполучити (як-є а) (список (як-є с))) (сполучити (як-є б) (список (як-є т))))))) (як-є б))
  (0101 (011 (011 (мапа-факт-від (список (сполучити (як-є а) (список (як-є с))) (сполучити (як-є б) (список (як-є т))))))))
  (not? (101 (факт-від (сполучити (як-є а) (список (як-є с)))) (як-є б))))
