; Шість перевірок вектора з представленням через список.
; Перевіряються порожнеча, кількість елементів та доступ за індексом.
; Четверта відповідь має бути хибною через неправильний індекс.
; Індекси є десятковими математичними значеннями.

(список
  (однакові? (вектор-порожній) (як-є ()))
  (однакові?
    (вектор-кількість (список (як-є а) (як-є б) (як-є в)))
    3)
  (однакові?
    (вектор-н-тий 1 (список (як-є а) (як-є б) (як-є в)))
    (як-є б))
  (однакові?
    (вектор-н-тий 0 (список (як-є а) (як-є б) (як-є в)))
    (як-є б))
  (однакові?
    (вектор-н-тий 2 (список (як-є а) (як-є б) (як-є в)))
    (як-є в))
  (однакові? (вектор-кількість (вектор-порожній)) 0))
