; Д4 0010/0011: визначення функції самою СЕНС.
; Функція повертає цитований атом через свій параметр.
; Д1 керує лише умовами, помилку повертаємо структурно.
((функція (одержано)
   (за-умовою
     ((атом? одержано)
      (за-умовою
        ((тотожне? (тотожне? одержано (як-є мітка)) ні) так)
        (так (ні))))
     (так одержано)))
 (решта
   (репл-крок
     (прочитати "(перевірити (як-є мітка))")
     (репл-визначити-функцію
       (як-є перевірити)
       (прочитати "(значення)")
       (прочитати "значення")
       (репл-почати (як-є ()))))))
