; D4 0010/0011: визначення функції самою SENS.
; Функція повертає цитований атом через свій параметр.
; D1 керує лише умовами, помилку повертаємо структурно.
((функція (одержано)
   (за-умовою
     ((атом? одержано)
      (за-умовою
        ((тотожне? (тотожне? одержано (як-є мітка)) #d1:0) #d1:1)
        (#d1:1 (#d1:0))))
     (#d1:1 одержано)))
 (решта
   (репл-крок
     (прочитати "(перевірити (як-є мітка))")
     (репл-визначити-функцію
       (як-є перевірити)
       (прочитати "(значення)")
       (прочитати "значення")
       (репл-почати (як-є ()))))))
