; Закон: існує елемент, що задовольняє предикат.

(визначити існує?
  (функція (предикат залишок)
    (за-умовою
      ((атом? залишок) ні)
      ((предикат (перше залишок)) так)
      (так (існує? предикат (решта залишок))))))

(визначити є-б?
  (функція (значення)
    (тотожне? значення (як-є б))))

(визначити свідок-існує
  (функція ()
    (нехай ((с (сполучити (як-є а) (сполучити (як-є б) (як-є ())))))
      (за-умовою
        ((існує? є-б? с)
         (за-умовою
           ((тотожне? (існує? є-б? (сполучити (як-є а) (як-є ()))) ні)
            (як-є (закон-існує (status pass))))
           (так (як-є (закон-існує (status fail))))))
        (так (як-є (закон-існує (status fail))))))))

(свідок-існує)
