; Закон: зчепити два списки попарно (zip до коротшого).

(визначити парувати
  (функція (ліве праве)
    (за-умовою
      ((атом? ліве) (як-є ()))
      ((атом? праве) (як-є ()))
      (так (сполучити
             (сполучити (перше ліве) (сполучити (перше праве) (як-є ())))
             (парувати (решта ліве) (решта праве)))))))

(визначити свідок-парувати
  (функція ()
    (нехай ((л (сполучити (як-є а) (сполучити (як-є б) (як-є ()))))
            (п (сполучити (як-є ікс) (сполучити (як-є ігрек) (як-є ()))))
            (р (парувати л п)))
      (за-умовою
        ((тотожне? (перше (перше р)) (як-є а))
         (за-умовою
           ((тотожне? (перше (решта (перше р))) (як-є ікс))
            (як-є (закон-парувати (status pass))))
           (так (як-є (закон-парувати (status fail))))))
        (так (як-є (закон-парувати (status fail))))))))

(свідок-парувати)
