; Закон: структурна тотожність дерев (atom/pair) рекурсією.

(визначити дерево-тотожне?
  (функція (ліве праве)
    (за-умовою
      ((атом? ліве) (тотожне? ліве праве))
      ((атом? праве) ні)
      ((дерево-тотожне? (перше ліве) (перше праве))
       (дерево-тотожне? (решта ліве) (решта праве)))
      (так ні))))

(визначити свідок-дерева
  (функція ()
    (нехай ((т1 (сполучити (як-є а) (сполучити (як-є б) (як-є ()))))
            (т2 (сполучити (як-є а) (сполучити (як-є б) (як-є ()))))
            (т3 (сполучити (як-є а) (сполучити (як-є в) (як-є ())))))
      (за-умовою
        ((дерево-тотожне? т1 т2)
         (за-умовою
           ((тотожне? (дерево-тотожне? т1 т3) ні)
            (як-є (закон-дерево-тотожне (status pass))))
           (так (як-є (закон-дерево-тотожне (status fail))))))
        (так (як-є (закон-дерево-тотожне (status fail))))))))

(свідок-дерева)
