; Закон: елемент є членом, якщо збігається з першим або є в решті.

(визначити член?
  (функція (що де)
    (за-умовою
      ((атом? де) ні)
      ((тотожне? що (перше де)) так)
      (так (член? що (решта де))))))

(визначити свідок-члена
  (функція ()
    (нехай ((с (сполучити (як-є а) (сполучити (як-є б) (як-є ())))))
      (за-умовою
        ((тотожне? (член? (як-є б) с) так)
         (за-умовою
           ((тотожне? (член? (як-є в) с) ні)
            (як-є (закон-член (status pass))))
           (так (як-є (закон-член (status fail))))))
        (так (як-є (закон-член (status fail))))))))

(свідок-члена)
