; Закон: усі елементи задовольняють предикат (першокласний).

(визначити усі?
  (функція (предикат залишок)
    (за-умовою
      ((атом? залишок) так)
      ((предикат (перше залишок)) (усі? предикат (решта залишок)))
      (так ні))))

(визначити атом-непорожній?
  (функція (значення)
    (за-умовою
      ((атом? значення)
       (за-умовою
         ((тотожне? значення (як-є ())) ні)
         (так так)))
      (так ні))))

(визначити свідок-усі
  (функція ()
    (нехай ((добре (сполучити (як-є а) (сполучити (як-є б) (як-є ()))))
            (погано (сполучити (як-є а) (сполучити (як-є ()) (як-є ())))))
      (за-умовою
        ((усі? атом-непорожній? добре)
         (за-умовою
           ((тотожне? (усі? атом-непорожній? погано) ні)
            (як-є (закон-усі (status pass))))
           (так (як-є (закон-усі (status fail))))))
        (так (як-є (закон-усі (status fail))))))))

(свідок-усі)
