; Закон: перевернути двічі повертає структуру (на двох елементах).

(визначити перевернути
  (функція (залишок накопичувач)
    (за-умовою
      ((атом? залишок) накопичувач)
      (так (перевернути
             (решта залишок)
             (сполучити (перше залишок) накопичувач))))))

(визначити свідок-перевернути
  (функція ()
    (нехай ((вихід (сполучити (як-є а) (сполучити (як-є б) (як-є ()))))
            (раз (перевернути вихід (як-є ())))
            (два (перевернути раз (як-є ()))))
      (за-умовою
        ((тотожне? (перше два) (як-є а))
         (за-умовою
           ((тотожне? (перше (решта два)) (як-є б))
            (як-є (закон-перевернути (status pass))))
           (так (як-є (закон-перевернути (status fail))))))
        (так (як-є (закон-перевернути (status fail))))))))

(свідок-перевернути)
