; Закон: згорнути список бінарною операцією (правий акумулятор).

(визначити згорнути
  (функція (операція залишок накопичувач)
    (за-умовою
      ((атом? залишок) накопичувач)
      (так (згорнути операція (решта залишок)
             (операція (перше залишок) накопичувач))))))

(визначити взяти-перше
  (функція (нове старе)
    нове))

(визначити свідок-згорнути
  (функція ()
    (нехай ((с (сполучити (як-є а) (сполучити (як-є б) (як-є ()))))
            (р (згорнути взяти-перше с (як-є порожньо))))
      (за-умовою
        ((тотожне? р (як-є б))
         (як-є (закон-згорнути (status pass))))
        (так (як-є (закон-згорнути (status fail))))))))

(свідок-згорнути)
