; СЕНС: перша сусідня пара атомів, суфікс без копіювання О(н).
(визначити суфікс-першої-сусідньої-пари-атомів
 (функція (хвіст)
  (за-умовою
   ((порожній? хвіст) (як-є ()))
   ((порожній? (решта хвіст)) (як-є ()))
   ((хибне? (атом? (перше хвіст)))
    (суфікс-першої-сусідньої-пари-атомів (решта хвіст)))
   ((хибне? (атом? (друге хвіст)))
    (суфікс-першої-сусідньої-пари-атомів (решта хвіст)))
   ((тотожне? (перше хвіст) (друге хвіст)) хвіст)
   (так (суфікс-першої-сусідньої-пари-атомів (решта хвіст))))))

(за-умовою
 ((порожній? (суфікс-першої-сусідньої-пари-атомів (як-є ()))) так)
 (так (перше (як-є ()))))
(за-умовою
 ((тотожне? (перше (суфікс-першої-сусідньої-пари-атомів
   (список (як-є атом?) (як-є атом?) (як-є решта)))) (як-є атом?)) так)
 (так (перше (як-є ()))))
(за-умовою
 ((порожній? (суфікс-першої-сусідньої-пари-атомів
   (список (список (як-є атом?)) (список (як-є атом?))))) так)
 (так (перше (як-є ()))))
(атом? (як-є ()))
