; Д3/Д4: четвериця розбивається на дві впорядковані пари.
(визначити розділити-четвірку-на-пари
  (функція (четвірка)
    (список
      (список (перше четвірка) (друге четвірка))
      (список (перше (решта-решти четвірка))
              (друге (решта-решти четвірка))))))
(визначити отримані-пари
  (розділити-четвірку-на-пари
    (список (як-є атом?) (як-є тотожне?) (як-є решта) (як-є сполучити))))
(за-умовою
  ((тотожне? (перше (перше отримані-пари)) (як-є атом?))
   (за-умовою
     ((тотожне? (друге (перше отримані-пари)) (як-є тотожне?))
      (за-умовою
        ((тотожне? (перше (друге отримані-пари)) (як-є решта))
         (за-умовою
           ((тотожне? (друге (друге отримані-пари)) (як-є сполучити))
            (хибне? (тотожне? (перше (друге отримані-пари)) (як-є атом?))))
           ((атом? (як-є ())) (перше (як-є ())))))
        ((атом? (як-є ())) (перше (як-є ())))))
     ((атом? (як-є ())) (перше (як-є ())))))
  ((атом? (як-є ())) (перше (як-є ()))))
