; Рекурсивний REV з Appendix B: рекурсивно перевертає вкладені списки.
(назви-рівні?
  (обчислити-програму-та-вираз
    (як-є ((визначити обернути-ядро1
             (мітка обернути-ядро1
               (функція (x)
                 (програма (y z)
                   (мітка початок)
                   (за-умовою ((порожній? x) (повернути y)))
                   (встановити-ім'я z (перше x))
                   (за-умовою ((атом? z) (перейти продовжити)))
                   (встановити-ім'я z (обернути-ядро1 z))
                   (мітка продовжити)
                   (встановити-ім'я y (сполучити z y))
                   (встановити-ім'я x (решта x))
                   (перейти початок)))))))
    (як-є (обернути-ядро1 (як-є (а ((б в) г))))))
  (як-є ((г (в б)) а)))
