(
  (name . "addition-is-commutative")
  (types . ("int" "int"))
  (expr . "(числовий-рівність (додати x y) (додати y x))")
)
(
  (name . "string-append-is-associative")
  (types . ("string" "string" "string"))
  (expr . "(однакові? (рядок-додати x (рядок-додати y z)) (рядок-додати (рядок-додати x y) z))")
)
(
  (name . "reverse-reverse-is-identity")
  (types . ("list"))
  (expr . "(однакові? (зворот (зворот x)) x)")
)
(
  (name . "persistent-map-insert-idempotency")
  (types . ("string-list" "string" "string"))
  (expr . "(нехай ((мапа (побудувати-мапу x мапа-порожній))) (однакові? (мапа-вставити y z (мапа-вставити y z мапа)) (мапа-вставити y z мапа)))")
)
(
  (name . "persistent-map-sorted-order")
  (types . ("string-list"))
  (expr . "(нехай ((мапа (побудувати-мапу x мапа-порожній))) (ключі-мапи-впорядковані? (мапа-список мапа)))")
)
(
  (name . "persistent-map-height-bound")
  (types . ("string-list"))
  (expr . "(нехай ((мапа (побудувати-мапу x мапа-порожній))) (нехай ((висота (height-of мапа)) (кількість (довжина (мапа-список мапа)))) (не-менше? кількість (додати (число-фібоначчі (додати висота 2)) -1))))")
)
(
  (name . "world-monotonicity")
  (types . ("string-list" "string" "string"))
  (expr . "(нехай ((світ (побудувати-світ x (порожній-світ)))) (числовий-рівність (додати 1 (довжина (світ-журнал світ))) (довжина (світ-журнал (світ-повідомити світ y z)))))")
)
(
  (name . "world-rollback-identity")
  (types . ("string-list" "string" "string"))
  (expr . "(нехай ((світ (побудувати-світ x (порожній-світ)))) (однакові? (світ-батько (світ-повідомити світ y z)) світ))")
)
(
  (name . "knowledge-journal-append-only-monotonicity")
  (types . ("string-list" "string" "string"))
  (expr . "(нехай ((проміжне-один (визначити журнал-знань (як-є ()))) (проміжне-два (повідомити-всі-події x)) (попередня-довжина (довжина журнал-знань)) (проміжне-три (визначити-модуль \"mod\" (список z)))) (числовий-рівність (додати 1 попередня-довжина) (довжина журнал-знань)))")
)
(
  (name . "knowledge-journal-retract-inverse-of-tell")
  (types . ("string-list" "string"))
  (expr . "(нехай ((проміжне-один (визначити журнал-знань (як-є ()))) (проміжне-два (повідомити-всі-події x)) (перед-дією (модуль-клаузи-зараз \"mod\")) (проміжне-три (визначити-модуль \"mod\" (список y))) (проміжне-чотири (відкликати-знання \"mod\" y))) (однакові? перед-дією (модуль-клаузи-зараз \"mod\")))")
)
